# coding: utf-8

# Need to: pip install pypinyin==0.40.0
import sys
from pypinyin import constants
from pypinyin import core
from pypinyin import pinyin

BLACK_LIST = {
    '一', '七', '三', '上', '下', '不', '东', '丢', '两', '个', '中', '为',
    '丽', '么', '之', '乐', '乖', '九', '也', '习', '书', '买', '了', '事',
    '二', '云', '五', '产', '京', '亮', '亲', '人', '什', '今', '从', '他',
    '仗', '付', '以', '们', '会', '伯', '伸', '住', '你', '便', '倒', '假',
    '做', '像', '儿', '光', '兔', '入', '八', '公', '六', '共', '关', '兴',
    '具', '养', '再', '农', '冬', '冰', '冷', '几', '出', '刀', '分', '别',
    '到', '前', '力', '办', '加', '动', '勇', '包', '北', '十', '午', '南',
    '卜', '卡', '厂', '原', '去', '又', '友', '发', '变', '口', '只', '叫',
    '可', '右', '叶', '吃', '同', '名', '后', '向', '吗', '吧', '听', '吹',
    '呀', '告', '呜', '呢', '呱', '和', '咕', '咚', '咬', '哈', '响', '哥',
    '哪', '哭', '唱', '啊', '啦', '喊', '喜', '喝', '嘴', '四', '回', '因',
    '园', '国', '图', '圆', '圈', '土', '在', '地', '坐', '堆', '声', '夏',
    '外', '多', '大', '天', '太', '头', '夹', '女', '奶', '她', '好', '妈',
    '妹', '姐', '娃', '娘', '婆', '子', '字', '季', '学', '孩', '它', '定',
    '宝', '害', '家', '对', '小', '少', '尖', '就', '尺', '尾', '山', '工',
    '左', '己', '巴', '布', '带', '帮', '干', '年', '幼', '广', '应', '座',
    '开', '弟', '张', '当', '往', '很', '得', '心', '忘', '忙', '快', '念',
    '怎', '怕', '急', '总', '情', '想', '慢', '戏', '成', '我', '房', '所',
    '扇', '手', '才', '扑', '打', '找', '把', '抬', '抱', '拇', '拉', '拍',
    '拔', '拿', '指', '按', '捉', '掉', '接', '摔', '摸', '放', '救', '教',
    '敢', '数', '文', '新', '方', '无', '日', '早', '时', '明', '星', '春',
    '昨', '是', '晚', '更', '最', '月', '有', '朋', '朝', '期', '木', '朵',
    '村', '条', '来', '林', '果', '柳', '树', '样', '根', '桃', '桌', '梅',
    '梦', '棍', '森', '椅', '次', '歌', '正', '死', '每', '毛', '民', '气',
    '水', '求', '江', '汽', '沙', '没', '河', '油', '泪', '泳', '洋', '洞',
    '活', '浇', '浪', '海', '清', '游', '满', '漂', '火', '灯', '灰', '点',
    '烟', '烧', '照', '熊', '熟', '燕', '爬', '爱', '父', '爷', '爸', '片',
    '牙', '牛', '物', '狗', '狮', '狼', '猩', '猫', '猴', '玉', '玩', '现',
    '班', '球', '甜', '生', '用', '田', '电', '画', '病', '痛', '白', '百',
    '的', '盒', '目', '直', '眉', '看', '真', '眼', '着', '睛', '睡', '知',
    '石', '碰', '礼', '神', '离', '秋', '种', '科', '穿', '竹', '笑', '笔',
    '笨', '第', '等', '篮', '米', '红', '纸', '练', '给', '绿', '缝', '网',
    '羊', '美', '翻', '老', '耳', '聪', '肉', '肚', '背', '胡', '能', '脚',
    '脸', '自', '船', '色', '节', '花', '苔', '苗', '草', '荷', '莱', '菇',
    '菊', '萝', '落', '蓝', '藏', '蘑', '虎', '虫', '蛙', '行', '西', '要',
    '见', '觉', '角', '认', '诉', '话', '该', '语', '说', '请', '课', '谁',
    '谢', '象', '貌', '贝', '贴', '走', '赶', '起', '足', '跑', '跟', '路',
    '跳', '身', '躲', '车', '边', '达', '过', '近', '还', '这', '进', '远',
    '迷', '送', '逃', '道', '那', '都', '醒', '采', '里', '野', '金', '钟',
    '错', '长', '门', '闪', '问', '间', '阳', '阴', '难', '雨', '雪', '雷',
    '青', '静', '面', '音', '顶', '题', '风', '飞', '食', '饭', '饿', '香',
    '马', '驮', '高', '鱼', '鸟', '鸡', '鸭', '鹅', '鹿', '黄', '黑', '鼠',
    '鼻', '瓜', '乌', '鸦', '蜜', '蜂', '蜻', '蜓', '阿', '橙', '松', '伞', 
    '池', '王', '苹', '翅', '膀', '狐', '狸',
}

LIMIT = 20  # How many times to add pinyin for the same character.
ADDED_CNT = {}

def AddPinyinWithFilter(hans, blacklist):
  # Don't add pinyin for the characters in `blacklist`.
  res = ''
  added_cnt_in_line = {}
  for c in hans:
    res +=  c
    if (constants.RE_HANS.match(c) and c not in blacklist and 
        (c not in added_cnt_in_line or added_cnt_in_line[c] < 3) and
        (c not in ADDED_CNT or ADDED_CNT[c] < LIMIT)):
      if c not in added_cnt_in_line:
        added_cnt_in_line[c] = 0
      added_cnt_in_line[c] += 1
      if c not in ADDED_CNT:
        ADDED_CNT[c] = 0
      ADDED_CNT[c] += 1

      pyin = pinyin(c)
      assert len(pyin) == 1
      assert len(pyin[0]) == 1
      res += ('[%s]' % pyin[0][0])
  return res

def AddPinyin(in_path, out_path):
  with open(out_path, 'w') as out_f:
    with open(in_path, 'r') as in_f:
      for l in in_f.readlines():
        res = AddPinyinWithFilter(l, BLACK_LIST)
        out_f.write(res)

if __name__ == '__main__':
  AddPinyin(*sys.argv[1:])
